app/controllers/flats_controller.rb

SELECT "flats".* FROM "flats"
---
  def index
    @flats = Flat.all